; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	image3 - mode
	image0 - mode
	thermograph1 - mode
	infrared4 - mode
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(supports instrument1 infrared4)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument3 image3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument4 image0)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared2)
	(supports instrument5 infrared4)
	(supports instrument5 image3)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared2)
	(supports instrument6 image0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
)
(:goal (and
	(pointing satellite1 Star3)
	(pointing satellite2 Phenomenon7)
	(have_image Star5 infrared4)
	(have_image Phenomenon6 infrared4)
	(have_image Phenomenon7 infrared4)
	(have_image Planet8 infrared4)
	(have_image Planet9 image0)
	(have_image Phenomenon10 infrared2)
	(have_image Planet11 image0)
	(have_image Phenomenon12 infrared4)
	(have_image Phenomenon13 image0)
))

)

; plan
1. (turn_to satellite0 star1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star1)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 11
5. (take_image satellite0 phenomenon6 instrument1 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon13 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 11
7. (take_image satellite0 phenomenon13 instrument1 image0)
   added: (have_image phenomenon13 image0)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon12 instrument1 infrared4)
   added: (have_image phenomenon12 infrared4)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon10 instrument1 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 4 of 11
12. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 11
13. (take_image satellite0 phenomenon7 instrument1 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 5 of 11
14. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 5 of 11
15. (take_image satellite0 planet11 instrument1 image0)
   added: (have_image planet11 image0)
   goals met: 6 of 11
16. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 6 of 11
17. (take_image satellite0 planet8 instrument1 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 7 of 11
18. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 7 of 11
19. (take_image satellite0 planet9 instrument1 image0)
   added: (have_image planet9 image0)
   goals met: 8 of 11
20. (turn_to satellite0 star5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star5)
   goals met: 8 of 11
21. (take_image satellite0 star5 instrument1 infrared4)
   added: (have_image star5 infrared4)
   goals met: 9 of 11
22. (turn_to satellite1 star3 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star3)
   goals met: 10 of 11
23. (turn_to satellite2 phenomenon7 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon7)
   goals met: 11 of 11
